function getMessage(a, b){
//Если первый аргумент, а, имеет тип boolean, то
  if (typeof a == "boolean"){
//Если он true, вернуть строку, в которую подставлен параметр b:
    if (typeof a == true){
      return "Переданное GIF-изображение анимировано и содержит " + b + "кадров";
    }
//Если он false, то вернуть строку:
    if (a == false){
      return "Переданное GIF-изображение не анимировано"
    }
  }

//Если первый аргумент имеет числовой тип, то вернуть строку:
  if (typeof a == "number"){
    return "Переданное SVG-изображение содержит" + a + "объектов и " + (b * 4) + "атрибутов";
  }

//Если первый аргумент массив, то вернуть строку:
  if (Array.isArray(a)){
//где [sum] - это сумма значений переданного массива
    for(var i = 0; i < a.length; i++){
    var sum = 0;
    sum = sum + a[i];
  }
  return "Количество красных точек во всех строчках изображения: " + sum;
}

//Если оба аргумента массивы, то вернуть строку:
  if (Array.isArray(a) && Array.isArray(b)){
//где [square] - сумма произведений соответствующих элементов массивов a и b
    for(var i = 0; i < a.length; i++) {
      var square = 0;
      var arr = [];
      arr.push(a[i] * b[i]);
      square = square + arr[i];
    }
    return "Общая площадь артефактов сжатия: " + square + "пикселей";
  }
}
